Revit 2027 API
BuiltInFailures.MassFailures.MinSkylightWidthImperial Property
 The minimum skylight width is 8 inches.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MinSkylightWidthImperial { get; }
Public Shared ReadOnly Property MinSkylightWidthImperial As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MinSkylightWidthImperial {
	FailureDefinitionId^ get ();
}
static member MinSkylightWidthImperial : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace